"""
=============================
@Time : 2020/5/11 22:58
@Author : AllyZhou
@FileDec: 
==============================
"""
""""
1、小明买了一对小兔子（两只），第三个月起每个月都生一对兔子（两只），每对小兔子长到第三个月后每个月又生一对兔子（两只），
假如兔子都不死，问n个月的后的兔子总数为多 n  少只？请使用递归实现！"""


def func(x):
    if x == 1 or x == 2:
        return 2
    else:
        return func(x - 1) + func(x - 2)


# 2 一个球从100米高度自由落下，每次落地后反跳回原高度的一半；再落下，求它在第10次落地时，共经过多少米？请用递归实现！

# ""掉一次 100  掉2次  100+100  掉3次  100+100+50  掉4次  100+100+50+25.。。。。
# 然后就是 100+100+100/2+100/4
# 也就是 100+100+100/2+100/2**2
# 再变个形 100+100/2**0+100/2**1+100/2**2
# 所以，第n次掉落(n>1)时，就是100+100/2**0+100/2**1+100/2**2+...+100/2**(n-2)
# 除了第一次掉落你需要指定距离，其他几次就是f(n-1) + f(1)/2**(n-2)"""
def func2(x):
    if x == 1:
        return 100
    else:
        return func2(x-1)+func2(1)/2**(x-2)



# 362.17261904761904

# 3、小明有200元钱 打算买 200本书，A类书籍5元一本，B类书籍3元一本，C类书籍1元2本，请用程序算出小明一共有多少种买法?（面试笔试题）
# book = 200
# money = 200
# num = 0
def buy_book(money, book):
    num = 0
    for a in range(int(money / 5)):
        for b in range(int(money / 3)):
            for c in range(int(money + 1)):
                if a * 5 + b * 3 + c * 0.5 <= money and a + b + c == book:
                    num += 1
    return num


print(buy_book(200, 200))


"""
4、有一个列表 li2 = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15],

请用上课讲的知识处理成下面的格式：
"""
# li4 = [[1,2,3],[4,5,6],[7,8,9],[10,11,12],[13,14,15]]
#
# li2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
# # 解法1
# list1 = [[i, i + 1, i + 2] for i in li2[::3]]
# # 解法2
# list2 = list(map(lambda x: [x, x + 1, x + 2], li2[::3]))
