"""
============================
Author:柠檬班-木森
Time:2020/5/13   17:34
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
1、小明买了一对小兔子（两只），第三个月起每个月都生一对兔子（两只），
每对小兔子长到第三个月后每个月又生一对兔子（两只），
假如兔子都不死，问n个月的后的兔子总数为多少只？请使用递归实现！
1    1
2    1
3    1+  1
4    2+  1
5    3+  2
6    5+  3
7    8+  5  


2 一个球从100米高度自由落下，每次落地后反跳回原高度的一半；再落下，求它在第10次落地时，共经过多少米？请用递归实现！


3、小明有200元钱 打算买200本书，A类书籍5元一本，B类书籍3元一本，C类书籍1元2本，请用程序算出小明一共有多少种买法?（面试笔试题）
# a+b+c = 200
# a*5+b*3+c*0.5 =200




4、有一个列表 li2 = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15],
请用上课讲的知识处理成下面的格式：
li4 = [[1,2,3],[4,5,6],[7,8,9],[10,11,12],[13,14,15]]

"""


# 第一题：
def func(n):
    if n == 0:
        return 0
    if n == 1 or n == 2:
        return 1*2
    else:

        return func(n - 1) + func(n - 2)


# 第二题：求反弹高度
"""
1    100
2    100  +                         (100/2**1)*2          
3    100+100/2*2   +                (100/2*2)*2
4    100+100/2*2+100/2*2  +         (100/2*2*2)*2
5    100+100/2*2+100/2*2+100/2*2*2  (100/2*2*2*2)*2 
n    上一次   +                     （100/2**(n-1))*2

"""


def work2(n):
    if n == 1:
        return 100
    else:
        return work2(n - 1) + (100 / 2 ** (n - 1)) * 2


print(work2(10))


def work3():
    count = 0
    for a in range(200 // 5 + 1):
        for b in range(200 // 3 + 1):
            c = 200 - a - b
            if a * 5 + b * 3 + c * 0.5 <= 200:
                # print(f"a:{a},b:{b},c:{c}")
                count += 1
    return count


# count = work3()
# print('第3题：一个有{}种买法'.format(count))
# 钱花完 5中   钱不花玩479


# 第四题：
def func4():
    li2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
    return [li2[i:i + 3] for i in range(0, len(li2), 3)]
    # 使用进行切片进行拆分，使用zip进行聚合
    # zip_obj = zip(li2[::3], li2[1::3], li2[2::3])
    # # # 使用map进行类型转换
    # return list(map(lambda x: list(x), zip_obj))

# res = func4()
# print('第四题结果为:{}'.format(res))
